Repository: MaMaKow/dienstplan-apotheke
Catalog: locale/*/LC_MESSAGES/messages.po
Languages: de_de

source: There was an error while trying to upload the file.
de_de: Beim Hochladen der Datei trat ein Fehler auf.

source: UPLOAD_ERR_INI_SIZE: The uploaded file exceeds the upload_max_filesize directive in php.ini:
de_de: UPLOAD_ERR_INI_SIZE: Die hochgeladene Datei übersteigt die upload_max_filesize Regel in der php.ini:

source: Make sure, that your webserver allows overwriting of settings and reads .htaccess files!
de_de: Stellen Sie sicher, dass der Webserver das Überschreiben von Richtlinien per .htaccess Datei erlaubt!

source: For apache2 locate the apache configuration file e.g. /etc/apache2/apache2.conf
de_de: Für apache2 finden Sie die Konfigurationsdatei z.B. /etc/apache2/apache2.conf

source: Insert the following ruleset:
de_de: Fügen Sie folgende Regel ein:

source: UPLOAD_ERR_FORM_SIZE: The uploaded file exceeds the MAX_FILE_SIZE directive that was specified in the HTML form.
de_de: UPLOAD_ERR_FORM_SIZE: Die hochgeladene Datei übersteigt die MAX_FILE_SIZE Regel, welche im HTML Formular vorgegeben wurde.

source: UPLOAD_ERR_PARTIAL: The uploaded file was only partially uploaded.
de_de: UPLOAD_ERR_PARTIAL: Die Datei wurde nur teilweise hochgeladen.

source: UPLOAD_ERR_NO_FILE: No file was uploaded.
de_de: UPLOAD_ERR_NO_FILE: Es wurde keine Datei hochgeladen.

source: UPLOAD_ERR_NO_TMP_DIR: Missing a temporary folder.
de_de: UPLOAD_ERR_NO_TMP_DIR: Ein temporärer Ordner fehlt.

source: UPLOAD_ERR_CANT_WRITE: Failed to write file to disk
de_de: UPLOAD_ERR_CANT_WRITE: Fehler beim Schreiben der Datei auf die Festplatte

source: UPLOAD_ERR_EXTENSION: A PHP extension stopped the file upload.
de_de: UPLOAD_ERR_EXTENSION: Eine PHP Erweiterung hat das Hochladen der Datei gestoppt.

source: Unknown upload error.
de_de: Unbekannter Fehler beim Hochladen.

source: Sorry, only ASYS PEP files are allowed.
de_de: Leider sind nur ASYS PEP-Dateien erlaubt.

source: You tried to upload: %1$s.
de_de: Sie haben versucht %1$s hochzuladen.

source: Please upload a valid ASYS PEP file!
de_de: Bitte eine korrekt formatierte ASYS PEP Datei hochladen!

source: Sorry, your file does not have the correct format.
de_de: Entschuldigung, Ihre Datei hat nicht das korrekte Format.

source: Sorry, there was an error uploading your file.
de_de: Beim Hochladen Ihrer Datei ist ein Fehler aufgetreten.

source: The file %1$s has been uploaded.
de_de: Die Datei %1$s wurde hochgeladen.

source: It will be processed in the background.
de_de: Sie wird im Hintergrund verarbeitet.

source: Sorry, your file could not be opened.
de_de: Entschuldigung, Ihre Datei konnte nicht geöffnet werden..

source: User Email
de_de: Benutzer Email

source: Employee Key
de_de: Mitarbeitende Schlüssel

source: User Status:
de_de: Benutzer Status:

source: Privileges
de_de: Privilegien

source: The password was successfully changed.
de_de: Ihre Passphrase wurde erfolgreich geändert.

source: User page for user %1$s
de_de: Benutzerseite für Benutzer*in %1$s

source: Receive emails when the roster is changed
de_de: Emails empfangen, wenn der Dienstplan geändert wird

source: Upon changes in the roster that are less than 2 weeks in the future a notification may be sent. A maximum of one mail per day will be sent.
de_de: Bei Änderungen des Dienstplans, die weniger als 2 Wochen in der Zukunft liegen, kann eine Benachrichtigung gesendet werden. Es wird maximal eine Mail pro Tag gesendet.

source: Change password
de_de: Passphrase ändern

source: Old password
de_de: Alte Passphrase

source: New password
de_de: Neue Passphrase

source: Repeat new password
de_de: Neue Passphrase wiederholen

source: Please enter the correct calculation result!
de_de: Bitte geben Sie die korrekte Lösung der Rechenaufgabe ein!

source: This username is already taken.
de_de: Der Benutzername ist bereits vergeben.

source: You have been successfully registered.
de_de: Sie wurden erfolgreich registriert.

source: Once your user is unlocked, you can %1$s log in.%2$s
de_de: Sobald Ihr Benutzer freigeschaltet ist, können Sie sich %1$s einloggen.%2$s

source: Unfortunately, an error occurred while saving.
de_de: Beim Abspeichern ist leider ein Fehler aufgetreten.

source: User name
de_de: Benutzername

source: What does %1$s + %2$s equal?
de_de: Was ergibt %1$s + %2$s?

source: Solution
de_de: Lösung

source: The user account will be verified after the registration. This may take a while. You will be informed by email after the verification is complete.
de_de: Nach der Anmeldung wird der Benutzer zunächst überprüft. Dies kann eine Weile dauern. Wir informieren Sie nach Abschluss der Prüfung per Email.

source: employee key
de_de: Mitarbeitende Schlüssel

source: created at
de_de: angelegt am

source: Error while writing the file to disk.
de_de: Fehler beim Schreiben der Datei auf die Festplatte.

source: Error while writing the trigger file to disk.
de_de: Fehler beim Schreiben der Trigger Datei auf die Festplatte.

source: Error while writing the database hash file to disk.
de_de: Fehler beim Schreiben des Datenbankhashes auf die Festplatte.
