Repository: MaMaKow/dienstplan-apotheke
Catalog: docs/po4a/po/*.po
Languages: de

source: Contact email address\\ is used for questions and comments from the users. Also this email will receive some internal information from the roster.
de: Die Kontakt-E-Mail-Adresse \\ wird für Fragen und Kommentare von Benutzern verwendet. Diese E-Mail erhält auch einige interne Informationen aus dem Dienstplan.

source: Administrator password\\ the password used by the administrator to login into the program in the future.
de: Administrator-Passwort \\ das Passwort, das der Administrator verwendet, um sich in Zukunft am Programm anzumelden.

source: Please register the administrator and click \menu{Submit}. The data will be written to the file \directory{config/config.php}. For every user, that uses the program, there has be be exactly one employee. \subsection{First steps} After submitting the administrator configuration, you will be forwarded to the login page. Login with your administrator credentials.
de: Bitte registrieren Sie den Administrator und klicken Sie auf \menu{Senden}. Die Daten werden in die Datei \directory{config/config.php} geschrieben. Für jeden Benutzer, der das Programm benutzt, muss es genau einen Mitarbeiter geben. \subsection {Erste Schritte} Nach dem Absenden der Administratorkonfiguration werden Sie auf die Anmeldeseite weitergeleitet. Melden Sie sich mit Ihren Administrator-Anmeldeinformationen an.

source: On your first login you will be prompted with the branch management. Please create at least one branch. You can reach this page at all times in the menu \menu{Administration > Branch Management}.
de: Bei Ihrer ersten Anmeldung werden Sie mit der Filialverwaltung konfrontiert. Bitte erstellen Sie mindestens eine Filiale. Sie erreichen diese Seite jederzeit über das Menü \menu{Administration > Filialverwaltung}.

source: The next logical step is to setup some more employees in the \menu{Administration > Human resource management}.
de: Der nächste logische Schritt ist die Einrichtung einiger weiterer Mitarbeiter in \menu{Administration > Personalverwaltung}.

source: After all the employees are inserted, you can just start to write rosters (\menu{Daily View > Daily input}) or you might create principle rosters for specific weekdays (\menu{Daily view > principle roster daily}) or for distinct employees (\menu{Employee > Principle roster employee}).
de: Nachdem alle Mitarbeiter eingefügt sind, können Sie mit dem Schreiben von Dienstpläne beginnen (\menu{Tagesansicht > Tagesansicht Eingabe}) oder Sie können Grundpläne erstellen für bestimmte Wochentage (\menu{ Tagesansicht > Grundplan Tagesansicht}) oder für unterschiedliche Mitarbeiter (\menu{Mitarbeiter > Grundplan Mitarbeiter}).

source: Upgrading
de: Aktualisierung

source: Until now, there is no automatic update mechanism established. You can regularly download release packages from GitHub. Or you can stay in touch via git:
de: Bis jetzt gibt es keinen automatischen Update-Mechanismus. Sie können regelmäßig Release-Pakete von GitHub herunterladen. Oder Sie können über Git in Kontakt bleiben:

source: \emph{CAVE:} Make sure, that you keep your \directory{config/config.php}! It should not be changed by git, because it is listed in the .gitignore file of this project.
de: \emph{CAVE:} Stellen Sie sicher, dass Sie Ihr \directory{config/config.php} behalten! Es sollte nicht von Git geändert werden, da es in der .gitigore-Datei dieses Projekts aufgeführt ist.

source: Configuration
de: Konfiguration

source: You can manually edit the file \directory{config/config.php}. The default values are:
de: Sie können die Datei \directory{config/config.php} manuell bearbeiten. Die Standardwerte sind:

source: Never delete the first two lines! If the file does not start with \lstinline|<?php| then PHP will not handle it, meaning that anyone can read its content.
de: Löschen Sie niemals die ersten zwei Zeilen! Wenn die Datei nicht mit \lstinline|<?php| beginnt, wird PHP sie nicht verarbeiten, was bedeutet, dass jeder ihren Inhalt lesen kann.

source: Maintenance
de: Wartung

source: The file \directory{src/php/background\_maintenance.php} will be called on every login of any user. It will create an instance of the following classes:
de: Die Datei \directory{src/php/background\_maintenance.php} wird bei jedem Login eines beliebigen Benutzers aufgerufen. Es wird eine Instanz der folgenden Klassen erzeugen:

source: maintenance
de: Wartung

source: class maintenance
de: Klasse maintenance

source: The methods contained in the class maintenance are only called, if the last execution is at least \lstinline|MAINTENANCE_PERIOD_IN_SECONDS| ago. \lstinline|MAINTENANCE_PERIOD_IN_SECONDS| is set to once a day.
de: Die Methoden, die in der Klassen maintenance enthalten sind, werden nur dann aufgerufen, wenn die letzte Ausführung mindestens \lstinline|MAINTENANCE_PERIOD_IN_SECONDS| her ist. \lstinline|MAINTENANCE_PERIOD_IN_SECONDS| ist auf einmal am Tag eingestellt.

source: The method \lstinline|user_dialog_email->aggregate_messages_about_changed_roster_to_employees()| is called to send out emails to employees, whose roster has been changed.
de: Die Methode \lstinline|user_dialog_email->aggregate_messages_about_changed_roster_to_employees()| wird dazu aufgerufen, E-Mails an Mitarbeiter zu senden, deren Dienstplan geändert wurde.

source: The method \lstinline|maintenance->cleanup_overtime()| does not do anything yet. It is meant to be used to clean up overtime of existing employees, that happened before they entered the company.
de: Die Methode \lstinline|maintenance->cleanup_overtime()| tut noch nichts. Sie soll zum Säubern von Überstunden bestehender Mitarbeiter eingesetzt werden, welche vor dem Eintritt in das Unternehmen eingetragen wurden.

source: The method \lstinline|maintenance->cleanup_absence()| does not do anything yet. It is meant to be used to clean up absences of existing employees, that happened before they entered the company.
de: Die Methode \lstinline|maintenance->cleanup_absence()| tut noch nichts. Sie soll zur Säuberung von Abwesenheiten bestehender Mitarbeiter eingesetzt werden, welche vor dem Eintritt in das Unternehmen eingetragen wurden.

source: class update\_database
de: Klasse update\_database

source: Before the class update\_database executes any of its methods, it checks if there is any change in the official database structure since the last update. It compares the pdr\_database\_version\_hash from the table pdr\_self in the database with the value \lstinline|PDR_DATABASE_VERSION_HASH| stored in the file \directory{src/php/database\_version\_hash.php}
de: Bevor die Klasse update\_database eine ihrer Methoden ausführt, prüft sie, ob sich die offizielle Datenbankstruktur seit der letzten Aktualisierung geändert hat. Sie vergleicht den pdr\_database\_version\_hash aus der Tabelle pdr\_self in der Datenbank mit dem Wert \lstinline|PDR_DATABASE_VERSION_HASH| In der Datei \directory{src/php/database\_version\_hash.php}

source: The class should contain every SQL Query necessary to change an existing database into the new structure without loosing any data.
de: Die Klasse sollte jede SQL-Abfrage enthalten, die notwendig ist, um eine bestehende Datenbank in die neue Struktur zu überführen, ohne Daten zu verlieren.

source: Issues and Troubleshooting
de: Probleme und Fehlerbehebung

source: Issues are tracked at GitHub \url{https://github.com/MaMaKow/dienstplan-apotheke/issues} I am trying to answer any question within 3 days.
de: Fragen werden bei GitHub \url{https:/github.com/MaKow/dienstplan-apotheke/issues} bearbeitet. Ich versuche, jede Frage innerhalb von 3 Tagen zu beantworten.

source: Developer manual
de: Entwicklerhandbuch

source: Core development
de: Kernentwicklung

source: All PHP scripts have a common file \texttt{default.php}, which handles the default settings. It is placed at ./, which is the \texttt{PDR\_FILE\_SYSTEM\_APPLICATION\_PATH}. See the file below: \lstinputlisting[language=PHP]{../default.php}
de: Alle PHP-Skripte laden eine gemeinsame Datei \texttt{default.php}, die die Standardeinstellungen vornimmt. Sie befindet sich in ./, welches der \texttt{PDR\_FILE\_SYSTEM\_APPLICATION\_PATH} ist. Siehe folgende Datei: \lstinputlisting[language=PHP]{../default.php}

source: Directory structure
de: Ordnerstruktur

source: \directory{config/} Contains the configuration file config.php
de: \directory{config/} Enthält die Konfigurationsdatei config.php

source: \directory{css/} \emph{obsolete}, use \directory{src/css/} instead
de: \directory{css/} \emph{veraltet}, verwenden Sie stattdessen \directory{src/css/}

source: \directory{docs/} This documentation and tools to build it
de: \directory{docs/} Diese Dokumentation und Werkzeuge, um sie zu bauen

source: \directory{img/} Images used by the program
de: \directory{img/} Bilder, die vom Programm verwendet werden

source: \directory{js/} \emph{obsolete}, use \directory{src/js/} instead
de: \directory{js/} \emph{obsolet}, benutzen Sie stattdessen \directory{src/js/}

source: \directory{locale/} translation files for gettext, currently only german (de\_DE)
de: \directory{locale/} Übersetzungsdateien für gettext, derzeit nur Deutsch (de\_DE)

source: \directory{src/} Most of the actual source code
de: \directory{src/} Der Hauptteil des eigentlichen Quellcodes

source: \directory{src/css} Style Sheets
de: \directory{src/css} Cascading Style Sheets

source: \directory{src/php/classes/} Contains all the class files class.class\_name.php
de: \directory{src/php/classes/} Enthält alle Klassendateien class.class\_name.php

source: \directory{src/php/fragments/} parts of bigger pages, may be included via php require/include or loaded with JavaScript
de: \directory{src/php/fragments/} Teile von größeren Seiten, können über PHP require/include oder mit JavaScript geladen werden

source: \directory{\textbf{src/php/pages/}} This is the place for the single views, which the human user will use to look at the roster etc.
de: \directory{\textbf{src/php/pages/}} Dies ist der Ort für die einzelnen Ansichten, welche der menschliche Benutzer verwenden wird, um den Dienstplan usw. zu sehen.

source: \directory{src/sql/} SQL Database Tables and Triggers
de: \directory{src/sql/} SQL-Datenbank Tabellen und Trigger

source: \directory{tests/} Tests to find errors in the source code; This folder is listed in .gitignore. Only some files are part of the visible source.
de: \directory{tests/} Tests, um Fehler im Quellcode zu finden; Dieser Ordner ist in .gitignore aufgeführt. Nur einige Dateien sind Teil der sichtbaren Quelle.

source: \directory{tmp/} A directory for temporary files. There is no automatic cleanup yet.
de: \directory{tmp/} Ein Verzeichnis für temporäre Dateien. Es gibt noch keine automatische Bereinigung.

source: \directory{upload/} The destination for uploaded content. Currently only specific *.PEP files produced by Awinta ASYS Smart are understood. Those files contain information about the amount of customers that have been served in the past.
de: \directory{upload/} Das Ziel für hochgeladene Inhalte. Momentan werden nur spezifische *.PEP-Dateien verstanden, die von Awta ASYS Smart erstellt wurden. Diese Dateien enthalten Informationen über die Anzahl der Kunden, die in der Vergangenheit bedient wurden.

source: Coding standards
de: Programmierstil

source: This project aims to follow some coding style guide.
de: Dieses Projekt versucht, einem Programmierstil zu folgen.

source: Please avoid StudlyCaps and camelCase.
de: Bitte vermeiden Sie StudlyCaps und camelCase (Binnenmajuskel).

source: Class constants MUST be declared in all upper case with underscore separators.
de: Klassenkonstanten MÜSSEN in Großbuchstaben mit Unterstrichtrennzeichen deklariert werden.

source: Property names MUST be written in under{\_}score.
de: Eigenschaftsnamen MÜSSEN in Unter\_strichen geschrieben werden.

source: Plain variables and objects are written in all lowercase.
de: Einfache Variablen und Objekte werden in Kleinbuchstaben geschrieben.

source: Array names start with a singe Uppercase letter followed by lowercase characters.
de: Array-Namen beginnen mit einem einzelnen Großbuchstaben, gefolgt von Kleinbuchstaben.

source: Method names MUST be written in under{\_}score.
de: Methodennamen müssen mit Unter\_strichen geschrieben werden.

source: Code MUST use 4 spaces for indenting, not tabs.
de: Der Code MUSS 4 Leerzeichen zum Einrücken verwenden, keine Tabulatoren.

source: Opening braces for classes and functions MUST go on the same line, and closing braces MUST go on the next line after the body.
de: Öffnende geschweifte Klammern für Klassen und Funktionen MÜSSEN in derselben Zeile stehen, und das Schließen geschweifter Klammern MUSS in der nächsten Zeile nach dem Text beginnen.

source: Opening braces for control structures SHOULD go on the same line, and closing braces MUST go on the next line after the body.
de: Öffnende geschweifte Klammern für Kontrollstrukturen SOLLTEN in derselben Zeile stehen, und das Schließen geschweifter Klammern MUSS in der nächsten Zeile nach dem Text beginnen.

source: Disk space is not rare anymore. IDEs are helping with autocomplete. There is no need to abbreviate stuff. Please use long terms like \lstinline|user_email_notification_cache| instead of \lstinline|usr_ml_ntfcn_ca| or \lstinline|u_e_n_c|.
de: Festplattenplatz ist nicht mehr knapp. IDEs helfen mit Autoverfollständung. Es ist nicht nötig, Dinge abzukürzen. Bitte verwenden Sie lange Begriffe wie \lstinline|user_email_notification_cach| statt \lstinline|usr_ml_ntfcn_ca| oder \lstinline|u_e_n_c|.

source: The database
de: Die Datenbank

source: Currently there is only MySQL supported as a database management system (DBMS). The tables are:
de: Derzeit wird nur MySQL als Datenbankverwaltungssystem (DBMS) unterstützt. Die Tabellen sind:

source: absence (illness, vacation and other kinds of absence)
de: Abwesenheit (Krankheit, Urlaub und andere Arten von Abwesenheit)

source: approval (saves for each day if the leader has officially authorized the roster)
de: approval (speichert für jeden Tag, ob der Leiter offiziell den Dienstplan autorisiert hat)

source: branch (information about the main pharmacy and possible branches)
de: branch (Informationen über die Hauptapotheke und mögliche Filialen)

source: Dienstplan (the actual roster data; start, end, break)
de: Dienstplan (die tatsächlichen Dienstplandaten; Anfang, Ende, Pause)

source: employees (employee data; employee\_id, name, profession, abilities)
de: employees (Mitarbeiterdaten; Mitarbeiter\_id, Name, Beruf, Fähigkeiten)

source: employees\_backup (a copy of the employees table with historical data archived)
de: employees\_backup (eine Kopie der Mitarbeitertabelle mit archivierten historischen Daten)

source: Feiertage (obsolete)
de: Feiertage (obsolet)

source: Grundplan\_roll (not used yet)
de: Grundplan\_roll (noch nicht benutzt)

source: Grundplan (the basic plan; Beginning, end, pause; is used to suggest new rosters)
de: Grundplan (der Grundsatzplan; Anfang, Ende, Pause; wird verwendet, um neue Dienstpläne vorzuschlagen)

source: maintenance (obsolete)
de: Wartung (obsolet)

source: Mandant (obsolete)
de: Mandant (obsolet)

source: Notdienst (dates of emergency services and the employees scheduled to them)
de: Notdienst (Daten der Notdienste und der ihnen zugewiesenen Mitarbeiter)

source: opening\_times\_special (not used yet)
de: opening\_times\_special (noch nicht benutzt)

source: opening\_times (the opening and closing times of the branches, no GUI yet for editing)
de: opening\_times (die Öffnungs- und Schließzeiten der Filialen, noch keine GUI zur Bearbeitung)

source: pdr\_self (reflects the state of the application itself)
de: pdr\_self (spiegelt den Zustand der Anwendung selbst wider)

source: pep\_month\_day (the relative amount of work on different days in the month)
de: pep\_month\_day (die relative Menge an Arbeit an verschiedenen Tagen im Monat)

source: pep (the raw amount of work data, hashed to reduce the amount of deleted/ignored entries)
de: pep (die rohen Daten zur Arbeitsmenge, gehashed, um die Anzahl der gelöschten / ignorierten Einträge zu reduzieren)

source: pep\_weekday\_time (the amount of work at different times on different weekdays)
de: pep\_weekday\_time (die Menge der Arbeit zu verschiedenen Zeiten an verschiedenen Wochentagen)

source: pep\_year\_month (the relative amount of work on different months in the year)
de: pep\_year\_month (die relative Menge an Arbeit in verschiedenen Monaten im Jahr)

source: saturday\_rotation (whose turn is it to work on which saturday?)
de: saturday\_rotation (Wer soll an welchem Samstag arbeiten?)

source: saturday\_rotation\_teams (who belongs to which team for saturday's rotation?)
de: saturday\_rotation\_teams (Wer gehört zu welcher Mannschaft für die Rotation am Samstag?)

source: Schulferien (not used yet)
de: Schulferien (noch nicht benutzt)

source: Stunden (overtime archive and balance)
de: Stunden (Überstundenarchiv und Saldo)

source: task\_rotation (rotating assignment of employees to a task, e.g. compounding)
de: task\_rotation (rotierende Zuordnung von Mitarbeitern zu einer Aufgabe, z.B. Rezeptur)

source: user\_email\_notification\_cache (not used yet)
de: user\_email\_notification\_cache (noch nicht benutzt)

source: users\_lost\_password\_token (tokens provided to change a forgotten password)
de: users\_lost\_password\_token (Token zur Verfügung gestellt, um ein vergessenes Passwort zu ändern)

source: users\_privileges (the privileges of the user accounts)
de: users\_privileges (die Berechtigungen der Benutzerkonten)

source: users (the user accounts; there has to be exacly one employee for every user account; there may be employees without user accounts)
de: users (die Benutzerkonten; Für jeden Benutzeraccount muss genau ein Mitarbeiter vorhanden sein. Es können Mitarbeiter ohne Benutzerkonten existieren)

source: Wunschplan (obsolete)
de: Wunschplan (obsolet)

source: A copy of all the table structures is stored in \directory{src/sql/}. The directory also contains the file \directory{src/sql/database\_version\_hash.php} which holds a SHA1 hash of all the structures returned by \verb|SHOW CREATE TABLE| and \verb|SHOW CREATE TRIGGER| after some modification. The hash is written by \directory{tests/get-database-structure.php}, see the details in that file.
de: Eine Kopie aller Tabellenstrukturen wird in \directory{src/sql/} gespeichert. Das Verzeichnis enthält auch die Datei \directory{src/sql/database\_version\_hash.php}, die einen SHA1-Hash aller Strukturen enthält, die von \begin{verbatim}SHOW CREATE TABLE\end{verbatim} und \begin{verbatim}SHOW CREATE TRIGGER\end{verbatim} nach einigen Änderungen zurückgegeben werden. Der Hash wird von \directory{tests/get-database-structure.php} geschrieben, siehe die Details in jener Datei.

source: Maintenance of the database
de: Pflege der Datenbank

source: There is a class \emph{update\_database}. This class holds a defined set of MySQL statements that alter the database structure from a known state in the past to the current state.
de: Es gibt eine Klasse \emph{update\_database}. Diese Klasse enthält eine definierte Menge von MySQL-Anweisungen, die die Datenbankstruktur von einem bekannten Zustand in der Vergangenheit in den aktuellen Zustand versetzen.

source: This class is not well tested. It might work. It might as well destroy the whole database.
de: Diese Klasse ist nicht gut getestet. Sie könnte funktionieren. Sie könnte auch die gesamte Datenbank zerstören.

source: The class \emph{update\_database} is called on every login of a user. It then decides on its own, if any actions have to be taken. In order to decide, the hash stored in the file \directory{database\_version\_hash.php} is compared to the hash stored in the database table \menu{pdr\_self > pdr\_database\_version\_hash}.
de: Die Klasse \emph{update\_database} wird bei jedem Login eines Nutzers aufgerufen. Sie entscheidet dann selbst, ob irgendwelche Maßnahmen ergriffen werden müssen. Um dies zu entscheiden, wird der in der Datei \directory{database\_version\_hash.php} gespeicherte Hash mit dem in der Datenbanktabelle gespeicherten Hash verglichen \menu{pdr\_self>pdr\_database\_version\_hash}.

source: Auto healing tables
de: Selbstheilende Tabellen

source: The class \emph{database\_wrapper} has a function \emph{create\_table\_from\_template()} that is able to create missing tables from the structure information given in \directory{src/sql/}. It is called if any PDO database query throws an exception with the code 42S02 and the MySQL error 1146.
de: Die Klasse \emph{database\_wrapper} hat eine Funktion \emph{create\_table\_from\_template()}, die in der Lage ist, fehlende Tabellen aus den Strukturinformationen zu erstellen, die im Verzeichnis \directory{src/sql/} gespeichert sind. Sie wird aufgerufen, wenn eine PDO-Datenbankabfrage eine Ausnahme mit dem Code 42S02 und dem MySQL-Fehler 1146 wirft.

source: Documentation
de: Dokumentation

source: This documentation about a programm, app or script is a stub. You can help this project by expanding it.
de: Diese Dokumentation über ein Programm, eine App oder ein Skript ist unvollständig. Sie können dieses Projekt unterstützen, indem Sie sie erweitern.

source: Testing
de: Testen

source: Bugs and Issues are tracked at GitHub \url{https://github.com/MaMaKow/dienstplan-apotheke/issues}
de: Fehler und Probleme werden bei GitHub verfolgt \url{https://github.com/MaMaKow/dienstplan-apotheke/issues}

source: Translation
de: Übersetzung

source: Translations are handled with gettext().
de: Übersetzungen werden mit gettext () verwaltet.

source: See this article about po4a about the translation of this document: \url{https://maltris.org/mehrsprachigkeit-fur-fast-alles-po4a-7317.html}
de: Lesen Sie diesen Artikel über po4a für die Übersetzung dieses Dokuments: \url{https://maltris.org/mehrsprachigkeit-fur-fast-alles-po4a-7317.html}

source: Internationalization
de: Internationalisierung

source: Different countries have different laws regarding pharmacies and employment. They also have different holidays.
de: Verschiedene Länder haben unterschiedliche Gesetze in Bezug auf Apotheken und Beschäftigung. Sie haben auch unterschiedliche Feiertage.
