Repository: MaMaKow/dienstplan-apotheke
Catalog: docs/po4a/po/*.po
Languages: de

source: User manual
de: Benutzerhandbuch

source: The web interface
de: Das Web-Interface

source: You can connect to your PDR instance using any web browser. Just navigate to your server and enter your username and password.
de: Sie können sich mit einem beliebigen Webbrowser mit Ihrer PDR-Instanz verbinden. Navigieren Sie einfach zu Ihrem Server und geben Sie Ihren Benutzernamen und Ihr Passwort ein.

source: Login page
de: Login Seite

source: The login page shows the name of the application. You are prompted to enter your username and password. If you do not have an account yet, you can \menu{Create a new user account}. If you have an account, but forgot about your password, or want to change it, you can click on \menu{Forgot password?}.
de: Die Anmeldeseite zeigt den Namen der Anwendung an. Sie werden aufgefordert, Ihren Benutzernamen und Ihr Passwort einzugeben. Wenn Sie noch keinen Account haben, können Sie \menu{Create a new account} erstellen. Wenn Sie ein Konto haben, aber Ihr Passwort vergessen haben oder es ändern möchten, können Sie auf \menu{Passwort vergessen?} Klicken.

source: Create new user account
de: Neuen Benutzer-Account erstellen

source: Register new user page
de: Registrierungsseite

source: Choose a user name, enter your employee id and your email. Pick a secure password.
de: Wählen Sie einen Benutzernamen, geben Sie Ihre Mitarbeiter-ID und Ihre E-Mail-Adresse ein. Wählen Sie ein sicheres Passwort.

source: The account will be inactive until an administrator activates it. The main administrator is informed via email regarding the registration.
de: Das Konto ist inaktiv, bis ein Administrator es aktiviert. Der Hauptadministrator wird per E-Mail über die Registrierung informiert.

source: New users can only be created for existing employees. New employees are created by an administrator.
de: Neue Benutzer können nur für vorhandene Mitarbeiter erstellt werden. Neue Mitarbeiter werden von einem Administrator erstellt.

source: Lost password
de: Passwort vergessen

source: Lost password page
de: Passwort vergessen Seite

source: The lost password page shows the name of the application. You are prompted to enter either your username, id or your email-address at your option. After you submit the form, an email is sent to your stored email address. In that email you will find a link, which will lead you to the password change page.
de: Auf der Seite "Passwort vergessen" wird der Name der Anwendung angezeigt. Sie werden aufgefordert, entweder Ihren Benutzernamen, Ihre ID oder Ihre E-Mail-Adresse einzugeben. Nachdem Sie das Formular abgeschickt haben, wird eine E-Mail an Ihre gespeicherte E-Mail-Adresse gesendet. In dieser E-Mail finden Sie einen Link, der Sie zur Seite zum Ändern des Passworts führt.

source: Lost password recovery
de: Wiederherstellung des Passwortes

source: Lost password recovery page
de: Wiederherstellungs-Seite für Passwörter

source: The lost password recovery page shows the name of the application and your user name. You are prompted to enter a new password twice.
de: Auf der Seite zur Wiederherstellung des verlorenen Passworts werden der Name der Anwendung und Ihr Benutzername angezeigt. Sie werden aufgefordert, ein neues Passwort zweimal einzugeben.

source: Navigation bar
de: Navigationsleiste

source: By default, the PDR web interface opens a menu containing 5 tiles. You can navigate to:
de: Standardmäßig öffnet die PDR-Weboberfläche ein Menü mit 5 Kacheln. Sie können navigieren zu:

source: Roster week table view
de: Dienstplan Wochenansicht

source: Roster daily view
de: Dienstplan Tagesansicht

source: Roster employee view
de: Dienstplan Mitarbeiteransicht

source: Overtime
de: Überstunden

source: Absence
de: Abwesenheit

source: The navigation bar
de: Die Navigationsleiste

source: In the top there is a navigation bar containing hyperlinks to nearly all the pages of PDR. Hover the mouse over an entry to open the submenus (Figure \ref{img_navigation_bar}).
de: Im oberen Bereich befindet sich eine Navigationsleiste mit Hyperlinks zu fast allen PDR-Seiten. Bewegen Sie die Maus über einen Eintrag, um die Untermenüs zu öffnen (Abbildung \ref{img_navigation_bar}).

source: \menu{Weekly view > .. }
de: \menu{Wochenansicht > .. }

source: \menu{.. > Weekly table}
de: \menu{.. > Wochen-Tabelle}

source: \menu{.. > Weekly images}
de: \menu{.. > Wochen-Bilder}

source: \menu{Daily view > .. }
de: \menu{Tagesansicht > .. }

source: \menu{.. > Daily input}
de: \menu{.. > Tagesansicht Eingabe}

source: \menu{.. > Daily output}
de: \menu{.. > Tagesansicht Ausgabe}

source: \menu{.. > Principle roster daily}
de: \menu{.. > Grundplan Tagesansicht}

source: \menu{Employee > .. }
de: \menu{Mitarbeiter > .. }

source: \menu{.. > Roster employee}
de: \menu{.. > Mitarbeiteransicht}

source: \menu{.. > Principle roster employee}
de: \menu{.. > Grundplan Mitarbeiter}

source: \menu{Overtime > ..}
de: \menu{Überstunden > ..}

source: \menu{.. > Overtime input}
de: \menu{.. > Überstunden Eingabe}

source: \menu{.. > Overtime output}
de: \menu{.. > Überstunden Ausgabe}

source: \menu{.. > Overtime overview}
de: \menu{.. > Überstunden Übersicht}

source: \menu{Absence > ..}
de: \menu{Abwesenheit > ..}

source: \menu{.. > Absence input}
de: \menu{.. > Abwesenheit Eingabe}

source: \menu{.. > Absence annual plan}
de: \menu{.. > Abwesenheit Jahresplan}

source: \menu{.. > Absence monthly plan}
de: \menu{.. > Abwesenheit Monatsplan}

source: \menu{.. > Attendance list}
de: \menu{.. > Anwesenheitsliste}

source: \menu{.. > Saturday list}
de: \menu{.. > Samstagsliste}

source: \menu{.. > Marginal employment hours list}
de: \menu{.. > Stundenzettel geringfügig Beschäftigte}

source: \menu{.. > Upload deployment planning}
de: \menu{.. > PEP-Upload}

source: \menu{.. > Human resource managament}
de: \menu{.. > Mitarbeiterverwaltung}

source: \menu{.. > Branch managament}
de: \menu{.. > Mandantenverwaltung}

source: \menu{.. > User managament}
de: \menu{.. > Benutzerverwaltung}

source: \menu{.. > Configuration}
de: \menu{.. > Konfiguration}

source: Roster week table view, excerpt without task rotation and weekly working hours
de: Dienstplan Wochenansicht, Auszug ohne Aufgabenrotation und wöchentliche Arbeitszeit

source: The roster week table view shows the roster of a chosen week and branch (Figure~\ref{img_roster_week_table_view}). If employees of the branch are working in an other branch, then those are shown below. The table foot contains the information about absent employees and their reason of absence.
de: Die Dienstplan-Wochenansicht zeigt die Liste einer ausgewählten Woche und Zweigstelle (Abbildung~\ref{img_roster_week_table_view}). Wenn Mitarbeiter der Zweigstelle in einer anderen Zweigstelle arbeiten, werden diese unten angezeigt. Der Tabellenfuß enthält Informationen über abwesende Mitarbeiter und deren Abwesenheitsgründe.

source: The date can be chosen by direct input. It can also be shifted by one week backwards or forwards by pressing \keys{\ctrl + \shift + \arrowkeyright} or \keys{\ctrl + \shift + \arrowkeyleft} respectively.
de: Das Datum kann durch direkte Eingabe ausgewählt werden. Es kann auch um eine Woche vor oder zurück verschoben werden, indem man \keys{\ctrl + \shift + \arrowkeyright} oder \keys {\ctrl + \shift + \arrowkeyleft} drückt.

source: Read only
de: Schreibgeschützt

source: In the daily roster view there is a table, a bar plot and a histogram reflecting the roster. The roster table lists all the employees scheduled in the chosen branch on the one chosen day. For every entry there is the employee id and last name, the working hours, the start and end of duty and the time of the lunch break, if any.
de: In der täglichen Dienstplanansicht gibt es eine Tabelle, ein Balkendiagramm und ein Histogramm, welche den Dienstplan widerspiegeln. Die Dienstplantabelle listet alle Mitarbeiter auf, die in dem ausgewählten Zweig an dem ausgewählten Tag geplant sind. Jeder Eintrag enthält die ID und den Nachnamen des Mitarbeiters, die Arbeitsstunden, den Beginn und das Ende des Dienstes und die Zeit der Mittagspause, falls vorhanden.

source: If an employee, that is primarily scheduled in the chosen branch, works in an other branch, then this entry is shown in the table at the bottom. An employee may have more than one entrie per day. This allows divided working time to be stored. If employees are absent, these absences are displayed in the table footer.
de: Wenn ein Mitarbeiter, der in erster Linie in der ausgewählten Filiale eingeplant ist, in einer anderen Filiale arbeitet, wird dieser Eintrag in der Tabelle unten angezeigt. Ein Mitarbeiter kann mehr als einen Eintrag pro Tag haben. Dadurch kann eine geteilte Arbeitszeit gespeichert werden. Wenn Mitarbeiter abwesend sind, werden diese Abwesenheiten in der Tabellenfußzeile angezeigt.

source: The roster bar plot shows the flow of employees coming and going. Each bar represents one entry. It reaches from the start of duty to its end. A white rectangle on the bar shows the time of the lunch break. The color of the bars is dependent on the profession of the employee. Pharmacists and Pharmazieingenieure \footnote{specific eastern german profession, see \url{https://de.wikipedia.org/wiki/Pharmazieingenieur}} are colored in dark green, while Pharmacy technicians are colored in light green. Other employees (non-pharmaceutical personnel) are colored in grey.
de: Das Dienstplan-Balken-Diagramm zeigt das Kommen und Gehen von Mitarbeitern. Jeder Balken repräsentiert einen Eintrag. Er reicht vom Beginn des Dienstes bis zu seinem Ende. Ein weißes Rechteck auf dem Balken zeigt die Zeit der Mittagspause an. Die Farbe der Balken hängt vom Beruf des Mitarbeiters ab. Apotheker und Pharmazieingenieure sind in dunkelgrün gefärbt, während PTA in hellgrün gefärbt sind. Andere Mitarbeiter (nichtpharmazeutisches Personal) sind grau hinterlegt.

source: The histogram plot shows a red area and a green line. The red area shows the expected amount of work (measured in packages per 15 minutes), while the green line represents the amount of working employees to any given time.
de: Das Histogramm zeigt einen roten Bereich und eine grüne Linie. Der rote Bereich zeigt den erwarteten Arbeitsaufwand (gemessen in Packungen pro 15 Minuten), während die grüne Linie die Anzahl der arbeitenden Mitarbeiter zu einem bestimmten Zeitpunkt darstellt.

source: Edit
de: Bearbeiten

source: The edit page looks quite similar to the read only view. The roster is examined for errors. If any issues occur, then errors, warnings or information will be shown in the top right area. The examination includes:
de: Die Bearbeitungsseite ähnelt der schreibgeschützten Ansicht. Der Dienstplan wird auf Fehler überprüft. Wenn Probleme auftreten, werden Fehler, Warnungen oder Informationen im oberen rechten Bereich angezeigt. Die Prüfung beinhaltet:

source: overlap of shifts for the same employee (Error)
de: Überlappung von Schichten für denselben Mitarbeiter (Fehler)

source: sufficient employee count (Warning, hardcoded at least two employees)
de: ausreichende Mitarbeiterzahl (Warnung, fest codiert mindestens zwei Mitarbeiter)

source: attendance of at least one pharmacist at any time (Error).
de: Anwesenheit von mindestens einem Apotheker zu jeder Zeit (Fehler).

source: attendance of at least one person able to carry out goods receipt (Warning).
de: Anwesenheit von mindestens einer Person, die den Wareneingang durchführen kann (Warnung).

source: scheduling of absent employees (Error)
de: Einsatz abwesender Mitarbeiter (Fehler)

source: non-scheduling of non-absent employees (Warning)
de: Nichteinplanung von nicht abwesenden Mitarbeitern (Warnung)

source: Only one break can be inserted per entry. If more breaks have to be assigned, then it is possible to enter multiple entries for the same employee. \subsection{Roster employee view} \subsection{Overtime} \subsection{Absence} There are four views to the absence data.
de: Pro Eintrag kann nur eine Pause eingefügt werden. Wenn mehr Pausen zugewiesen werden müssen, können mehrere Einträge für denselben Mitarbeiter eingegeben werden. \subsection{Mitarbeiterliste des Dienstplans} \subsection{Überstunden} \subsection{Abwesenheit} Es gibt vier Ansichten für die Abwesenheitsdaten.

source: Employee view readonly
de: Mitarbeiteransicht schreibgeschützt

source: Employee view edit
de: Mitarbeiteransicht Eingabe

source: Monthly table
de: Monatstabelle

source: Year overview
de: Jahrestabelle

source: In the \emph{Employee view readonly} there is a select element to choose the employee to view. There is a button to switch to the edit view. And there is a table containing the absence data. The columns are start and end of the absence, reason of absence and number of days. There is a distinct list of possible reasons ( vacation, remaining holiday, sickness, sickness of child, unpaid leave of absence, paid leave of absence, parental leave and maternity leave). The number of days of absence is calculated for a 5 day week. Absences on saturdays and sundays are registered but not counted. The same applys for holidays.
de: In der \emph{schreibgeschützten Mitarbeitersicht} gibt es ein Select-Element, um den anzuzeigenden Mitarbeiter auszuwählen. Es gibt eine Schaltfläche, um zur Bearbeitungsansicht zu wechseln. Und es gibt eine Tabelle mit den Abwesenheitsdaten. Die Spalten sind Beginn und Ende der Abwesenheit, Abwesenheitsgrund und Anzahl der Tage. Es gibt eine eindeutige Liste möglicher Gründe (Urlaub, Resturlaub, Krankheit, Krankheit des Kindes, unbezahlte Freistellung, bezahlte Freistellung, Elternzeit und Mutterschutz). Die Anzahl der Abwesenheitstage wird für eine 5-Tage-Woche berechnet. Abwesenheiten an Samstagen und Sonntagen werden registriert, aber nicht gezählt. Das Gleiche gilt für Feiertage.

source: Introduction
de: Einführung

source: Pharmacy Duty Roster (PDR) is a web application that allows to operate a duty roster for pharmacies. PDR started in 2015 as an alternative to a really simple excel sheet without formulas. PDR aims to be user-friendly but at the same time cover all necessary features. PDR continuously strives to improve. It is open to your requests and wishes. I hope it will fulfil your expectations.
de: Pharmacy Duty Roster (PDR) ist eine Webanwendung, die es ermöglicht, einen Dienstplan für Apotheken zu führen. PDR startete 2015 als Alternative zu einer wirklich einfachen Excel-Tabelle ohne Formeln. PDR möchte benutzerfreundlich sein und gleichzeitig alle notwendigen Funktionen abdecken. PDR ist ständig bestrebt, sich zu verbessern. Es ist offen für Ihre Anfragen und Wünsche. Ich hoffe, es wird Ihre Erwartungen erfüllen.

source: Getting PDR
de: PDR finden

source: The latest release of PDR is available on \href{https://github.com/MaMaKow/dienstplan-apotheke/releases/latest}{GitHub}. GitHub provides the source code as *.zip file or *.tar.gz ball. Extract the files into a folder.
de: Die neueste Version von PDR ist verfügbar unter \href{https://github.com/MaMaKow/dienstplan-apotheke/releases}{GitHub}. GitHub stellt den Quellcode als *.zip-Datei oder *.tar.gz Ball zur Verfügung. Extrahieren Sie die Dateien in einen Ordner.

source: Make sure to unpack PDR to a directory, that your webserver has access to. PHP and the webserver must have read access to all the files and folders. It also needs write access to the subdirectories upload, tmp and config. You might want to change the owner of the directory to the webservers user with e.g.:
de: Stellen Sie sicher, dass Sie PDR in ein Verzeichnis entpacken, auf das Ihr Webserver zugreifen kann. PHP und der Webserver müssen Lesezugriff auf alle Dateien und Ordner haben. Es benötigt auch Schreibzugriff auf die Unterverzeichnisse upload, tmp und config. Möglicherweise möchten Sie den Webserver-Benutzer zum Besitzer des Verzeichnisses machen mit z. B .:

source: You can also clone the repository with git:
de: Sie können das Repository auch mit git klonen:

source: See the Administrator manual for details!
de: Details finden Sie im Administratorhandbuch!

source: License
de: Lizenz

source: PDR is open source software under the AGPL license.
de: PDR ist Open-Source-Software unter der AGPL-Lizenz.

source: This program is free software: you can redistribute it and/or modify it under the terms of the GNU Affero General Public License as published by the Free Software Foundation, either version 3 of the License, or (at your option) any later version.
de: Dieses Programm ist freie Software: Sie können es unter den Bedingungen der GNU Affero General Public License, wie von der Free Software Foundation veröffentlicht, entweder Version 3 der Lizenz oder (nach Ihrer Wahl) einer späteren Version, weitergeben und / oder modifizieren.

source: This program is distributed in the hope that it will be useful, but WITHOUT ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the GNU Affero General Public License for more details.
de: Dieses Programm wird in der Hoffnung verbreitet, dass es nützlich sein wird, aber OHNE JEGLICHE GARANTIE; ohne auch nur die stillschweigende Gewährleistung der MARKTGÄNGIGKEIT oder EIGNUNG FÜR EINEN BESTIMMTEN ZWECK. Weitere Informationen finden Sie in der GNU Affero General Public License.

source: You should have received a copy of the GNU Affero General Public License along with this program. If not, see <https://www.gnu.org/licenses/>.
de: Sie sollten eine Kopie der GNU Affero General Public License zusammen mit diesem Programm erhalten haben. Wenn nicht, siehe <https://www.gnu.org/licenses/>.

source: Please see the \href{https://github.com/MaMaKow/dienstplan-apotheke/blob/master/LICENSE.md}{license file} for details!
de: Weitere Informationen finden Sie in der \href{https://github.com/MaMaKow/dienstplan-apotheke/releases}{Lizenzdatei}.

source: Reporting bugs
de: Fehler melden

source: The issue tracker is currently located at GitHub \url{https://github.com/MaMaKow/dienstplan-apotheke/issues}. GitHub requires an account in order to report bugs or feature requests. If you do not want to create one, you might send a mail to \href{mailto:pdr-issues@martin-mandelkow.de}{pdr-issues@martin-mandelkow.de}
de: Der Bugtracker befindet sich derzeit bei GitHub \url{https://github.com/MaMaKow/dienstplan-apotheke/issues}. GitHub benötigt ein Konto, um Fehler oder Feature-Anfragen zu melden. Wenn Sie keinen Account erstellen wollen, können Sie eine E-Mail an \href{mailto:pdr-issues@martin-mandelkow.de}{pdr-issues@martin-mandelkow.de} senden.

source: How to contribute
de: Wie Sie einen Beitrag leisten können

source: Pull requests are desired. If you made changes to PDR and want to contribute them to the public, you are welcome to open a pull-request on GitHub or send your changes in any other way.
de: Pull requests sind erwünscht. Wenn Sie Änderungen an PDR vorgenommen haben und diese der Öffentlichkeit beisteuern möchten, können Sie einen Pull requests auf GitHub öffnen oder Ihre Änderungen auf andere Weise senden.

source: You might as well use \lstinline|git send-email| and send patches to \href{mailto:pdr-discuss@martin-mandelkow.de}{pdr-discuss@martin-mandelkow.de}
de: Sie könnten auch \lstinline |git send-email| Und Patches an \href{mailto:pdr-discuss@martin-mandelkow.de}{pdr-discuss@martin-mandelkow.de} senden

source: Administrator manual
de: Administratorhandbuch

source: The latest release of PDR is available on \href{https://github.com/MaMaKow/dienstplan-apotheke/releases}{GitHub}
de: Die neueste Version von PDR ist verfügbar unter \href{https://github.com/MaMaKow/dienstplan-apotheke/releases}{GitHub}

source: You can also get the latest stable version via git:
de: Sie können auch die neueste stabile Version über Git erhalten:

source: The master branch is tested to be stable.
de: Der master Zweig ist auf Stabilität geprüft.

source: The installer
de: Die Installationsroutine

source: The first page shows some non-technical information about this program. Click \menu{Next} to move on.
de: Auf der ersten Seite finden Sie einige nicht-technische Informationen zu diesem Programm. Klicken Sie auf \menu{Next}, um weiterzugehen.

source: Welcome
de: Willkommen

source: On the second page some technical background information is given. You are informed about the necessary input data, required for continuing the installation. Available database management systems (currently only MySQL) are listed. Finally, you are informed about the user and password strategy for the database access. Click \menu{Next} again, to continue.
de: Auf der zweiten Seite sind einige technische Hintergrundinformationen gegeben. Sie werden über die für die Fortführung der Installation erforderlichen Eingangsdaten informiert. Die verfügbaren Datenbankverwaltungssysteme (derzeit nur MySQL) werden aufgelistet. Schließlich werden Sie über die Nutzer-und Passwortstrategie für den Datenbankzugriff informiert. Klicken Sie erneut auf \menu{Next}, um fortzufahren.

source: Requirements
de: Anforderungen

source: On the next page the application checks, if all requirements are met. These include a minimum PHP version, some PHP extensions and support for database connections. Also the program needs write access to some of its directories. If problems are found, then a descriptive error message will be shown. It is not possible to continue, until all issues are solved. Click \menu{Next} again, to continue.
de: Auf der nächsten Seite prüft die Anwendung, ob alle Voraussetzungen erfüllt sind. Dazu gehören eine minimale PHP-Version, einige PHP-Erweiterungen und die Unterstützung für Datenbankverbindungen. Das Programm benötigt Schreibzugriff auf einige seiner Verzeichnisse. Wenn Probleme gefunden werden, wird eine beschreibende Fehlermeldung angezeigt. Es ist nicht möglich, weiterzumachen, bis alle Probleme gelöst sind. Klicken Sie auf \menu{Next}, um fortzufahren.

source: Database configuration
de: Datenbankkonfiguration

source: The application now starts to collect configuration data.
de: Die Anwendung beginnt nun mit der Erhebung von Konfigurationsdaten.

source: Database type
de: Datenbanktyp

source: username \\An existing database user. The user MUST have the privilege to create a database. The user SHOULD have the privilege to create a less privileged user.
de: username \\Ein bestehender Datenbankbenutzer. Der Benutzer MUSS die Berechtigung haben, eine Datenbank zu erstellen. Der Benutzer SOLLTE das Privileg haben, einen weniger privilegierten Benutzer zu erstellen.

source: password \\The database password of the user. If a new user could be created, then a new secure random password will be given to the new user.
de: password \\Das Datenbankpasswort des Benutzers. Wenn ein neuer Benutzer erstellt werden konnte, wird dem neuen Benutzer ein neues sicheres zufälliges Passwort gegeben.

source: database name
de: Name der Datenbank

source: Enter the required data and \menu{Submit} it.
de: Geben Sie die erforderlichen Daten ein und klicken Sie \menu{Absenden}.

source: Administrator configuration
de: Administrative Konfiguration

source: After the database values are set, some information about the administrator is collected:
de: Nachdem die Datenbankwerte festgelegt wurden, werden einige Informationen zum Administrator gesammelt:

source: User name\\ the name used by the administrator to login into the program in the future.
de: Benutzername \\ Der Name, mit dem der Administrator sich in Zukunft im Programm anmeldet.

source: Last name\\ this name is connected to the employee id.
de: Nachname \\ Dieser Name ist mit der Mitarbeiter-ID verbunden.

source: Employee id\\ this is used to create an employee, who is connected to the administrative user.
de: Mitarbeiter-ID \\ Diese wird verwendet, um einen Mitarbeiter zu erstellen, der mit dem Benutzer mit Administratorrechten verbunden ist.
